       01 WRK-ENTRADA.
          05 WRK-CODIGO  PIC 9(04)  VALUE ZEROS.
          05 WRK-NOME    PIC X(15)  VALUE SPACES.
          05 WRK-SALARIO PIC 9(06)  VALUE ZEROS.
