       IDENTIFICATION              DIVISION.
       PROGRAM-ID. BASE.
      *========================================
      *== AUTOR: JOSE OLIVEIRA    EMPRESA: CDB
      *== OBJETIVO: ESTRUTURA DE PROGRAMA PRONTA
      *== DATA: XX/XX/20XX
      *== OBSERVACOES: INFORMACOES RELEVANTES
      *========================================
       ENVIRONMENT                DIVISION.
       CONFIGURATION              SECTION.

       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA                       DIVISION.
       WORKING-STORAGE            SECTION.


       PROCEDURE                  DIVISION.
       0100-RECEBE                SECTION.

       0150-PROCESSA              SECTION.

       0200-MOSTRA                SECTION.

       0300-FINALIZAR             SECTION.
                        STOP RUN.
