       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA01.
      *========================================
      *== AUTOR: JOSE OLIVEIRA    EMPRESA: CDB
      *== OBJETIVO: 1º CONTATO COM COBOL
      *== DATA: 04/02/2025
      *== OBSERVACOES: INFORMACOES RELEVANTES
      *========================================
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            DISPLAY "Hello Jose"
            DISPLAY " d'AGUA "
            STOP RUN.
       END PROGRAM PROGRAMA01.
