       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTE-GRAVACAO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT CLIENTES ASSIGN TO 'DADOS\CLIENTES.DAT'
        ORGANIZATION IS INDEXED
        ACCESS MODE IS SEQUENTIAL
        FILE STATUS IS CLIENTES-STATUS
        RECORD KEY IS CLIENTES-CHAVE.
       DATA DIVISION.
       FILE SECTION.
       FD CLIENTES.
       01 CLIENTES-REG.
          05 CLIENTES-CHAVE.
             10 CLIENTES-FONE PIC 9(09).
          05 CLIENTES-NOME PIC X(30).
          05 CLIENTES-EMAIL PIC X(40).
       WORKING-STORAGE                            SECTION.
       77 CLIENTES-STATUS   PIC 9(02).

       PROCEDURE DIVISION.
       000-PRINCIPAL.
           OPEN I-O CLIENTES.
           IF CLIENTES-STATUS EQUAL 35 THEN
               DISPLAY 'ARQUIVO NAO ENCONTRADO, CRIANDO...'
               OPEN OUTPUT CLIENTES
               CLOSE CLIENTES
               OPEN I-O CLIENTES
           END-IF.
           IF CLIENTES-STATUS NOT EQUAL 0
               DISPLAY 'ERRO AO ABRIR: ' CLIENTES-STATUS
               GO TO 999-FIM
           END-IF.
           MOVE 123456789 TO CLIENTES-FONE.
           MOVE 'TESTE NOME' TO CLIENTES-NOME.
           MOVE 'teste@email.com' TO CLIENTES-EMAIL.
           WRITE CLIENTES-REG.
           IF CLIENTES-STATUS NOT EQUAL 0
               DISPLAY 'ERRO AO GRAVAR: ' CLIENTES-STATUS
           ELSE
               DISPLAY 'GRAVACAO OK'
           END-IF.
           CLOSE CLIENTES.
       999-FIM.
           STOP RUN.
